{"pageProps":{"id":"near-create-react-app-typescript","title":"NEAR + create-react-app + TypeScript","date":"2022-02-03","contentHtml":"<p>Build fast with a <a href=\"https://github.com/AhaLabs/cra-template-near\">powerful frontend template</a> that integrates with NEAR:</p>\n<pre><code>npx create-react-app --template @ahalabs\n</code></pre>\n<p>Someone asked for this when I guest-lectured at a <a href=\"https://www.near.university/courses/near-certified-developer\">NEAR Certified Developer (NCD)</a> course.</p>\n<p>The NEAR ecosystem currently lacks a couple things:</p>\n<ul>\n<li>an obvious starting point when building a frontend app</li>\n<li>examples that use TypeScript to its full potential</li>\n</ul>\n<p>This is an attempt to quickly fill that gap.</p>\n<h2>Why not create-near-app?</h2>\n<p>Months ago, near.org pushed developers to use <code>create-near-app</code>. It has since been removed from the home page. Why?</p>\n<ul>\n<li>It tried to be too many things: vanilla JS, React, Vue, even Angular, and your choice of contract language, Rust or AssemblyScript. In its attempt to fill all of these needs and still be maintainable, its approach to any particular frontend tech was not particularly idiomatic. For example, the React template added lots of things to the <code>window</code> object, which can cause problems for people trying to switch to a React approach with Server-Side Rendering (SSR) or Static Site Generation (SSG).</li>\n<li>It was not well-maintained. I (<a href=\"https://twitter.com/chadoh\">@chadoh</a>) was its primary maintainer for a while, but Near Inc started prioritizing other things. No one else was hired/retained and given time to work on it. The project languished.</li>\n</ul>\n<p>At this point, create-near-app is fairly outdated.</p>\n<h2>What are people using instead?</h2>\n<p>There's no clear starting point. \"Go look at <a href=\"https://examples.near.org\">near.dev</a> and <a href=\"https://github.com/learn-near?q=L2\">NCD.L2 examples</a> and pick a project to fork,\" seems to be the general advice. This makes getting started pretty intimidating, especially for newbies.</p>\n<h2>An alternative</h2>\n<p>Students in the NCD class thought a lightweight create-react-app template would be nicer. If you try out the template, you'll see that it doesn't even include a smart contract. I like this for two reasons:</p>\n<ul>\n<li>It mimics the structure of NCD courses – the smart contract lives in a separate repository from the frontend.</li>\n<li>Long-term, if the dream of the Open Web / web3 succeeds, there will be way more frontends than contracts. Multiple frontends will be able to integrate with and remix already-existing contracts. App developers will hook into existing infrastructure and skip creating their own. So we should expect many frontends to integrate with already-deployed smart contracts.</li>\n</ul>\n<h2>Yay, TypeScript</h2>\n<p>When I asked if people thought I should use TypeScript, the general sentiment was \"I don't why you wouldn't.\"</p>\n<p>So the template uses TypeScript. It even adds proper typing to <a href=\"https://github.com/AhaLabs/cra-template-near/blob/main/template/src/contracts/guest-book.ts\">a contract-wrapper class</a>, since this is a <a href=\"https://github.com/near/near-api-js/issues/719\">common point of confusion</a>. Expect this <a href=\"https://github.com/AhaLabs/cra-template-near/pull/1\">approach to evolve</a> over the next few weeks as Aha Labs explores auto-generating these types from the contract source code.</p>\n<h2>The future</h2>\n<p>For the 2+ years I've been part of NEAR, I've badly wanted something analogous to the Ruby on Rails CLI. I want to be able to type something like <code>scaffold nft</code> and end up with both a smart contract and the frontend code to wrap it and integrate it into my app.</p>\n<p>React + TypeScript seem like <a href=\"https://2020.stateofjs.com/\">good choices</a> for the frontend part of this scaffolding.</p>\n<p>Is create-react-app the best choice? Unclear. I've <a href=\"https://github.com/AhaLabs/tenk-template-gatsby\">been</a> <a href=\"https://github.com/AhaLabs/tenk-template-nextjs\">researching</a> other approaches. Whatever we choose, this early work will transfer easily.</p>\n<p>Please try out this template and be loud with all feedback. Make pull-requests, make <a href=\"https://github.com/AhaLabs/cra-template-near/issues\">issues</a>, or just <code>@</code> me <a href=\"https://twitter.com/chadoh\">on Twitter</a>.</p>\n"},"__N_SSG":true}